app/views/tickets/edit.html.erb

SELECT "tickets".* FROM "tickets" WHERE "tickets"."project_id" = 2
---
			<ul id='tickets'>
			<% @project.tickets.each do |ticket| %>