app/views/tickets/show.html.erb

SELECT "tickets".* FROM "tickets" WHERE "tickets"."project_id" = 1 AND "tickets"."id" = ? LIMIT 1  [["id", "1"]]
---
			<ul id='tickets'>
			<% @project.tickets.each do |ticket| %>