app/views/projects/show.html.erb

		<ul>
			<% @project.tickets.each do |p| %>
---
SELECT "tickets".* FROM "tickets" WHERE "tickets"."project_id" = 1 AND "tickets"."id" = ? LIMIT 1  [["id", "1"]]