app/controllers/projects_controller.rb

  def index
		@project = Project.all
		@ticket = Ticket.all
---
SELECT "projects".* FROM "projects"
SELECT "tickets".* FROM "tickets"

	def create
		@project = Project.new(params[:project])
		if @project.save
---
INSERT INTO "projects" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Thu, 29 Nov 2012 19:28:23 UTC +00:00], ["name", "BukanTokoBaju"], ["updated_at", Thu, 29 Nov 2012 19:28:23 UTC +00:00]]

	def show
		@project = Project.find(params[:id])
		@projects = Project.all
		@tickpro = Ticket.all(params[:project_id])
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "projects".* FROM "projects"
SELECT "tickets".* FROM "tickets" WHERE "tickets"."project_id" = 1 AND "tickets"."id" = ? LIMIT 1  [["id", "1"]]

	def find_project
		@project = Project.find(params[:id])
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = 1 LIMIT 1