app/controllers/tickets_controller.rb

SELECT "projects".* FROM "projects"
---
	def new
		@ticket = @project.tickets.build
		@proj = Project.all

INSERT INTO "tickets" ("created_at", "description", "project_id", "title", "updated_at") VALUES (?, ?, ?, ?, ?)
---
	def create
		@ticket = @project.tickets.build(params[:ticket])
		if @ticket.save

SELECT "projects".* FROM "projects"
---
	def show
		@proj = Project.all

SELECT "projects".* FROM "projects"
---
	def edit
		@proj = Project.all

UPDATE "tickets" SET "title" = 'Payment #1009', "description" = 'This is a dummy data for this project. You can delete this after you pay me as much as you can! XP', "updated_at" = '2012-11-29 21:37:43.180812' WHERE "tickets"."id" = 3
---
	def update
		if @ticket.update_attributes(params[:ticket])

SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", "2"]]
---
	def find_project
		@project = Project.find(params[:project_id])

SELECT "tickets".* FROM "tickets" WHERE "tickets"."project_id" = 2 AND "tickets"."id" = ? LIMIT 1  [["id", "3"]]
---
	def find_ticket
		@ticket = @project.tickets.find(params[:id])