app/controllers/users_controller.rb

	def create
		@user = User.new(params[:user])

		respond_to do |format|
		  if @user.save
---
INSERT INTO "users" ("created_at", "email", "password", "updated_at", "username") VALUES (?, ?, ?, ?, ?)